WcfServices/federation/WCFCalcFederation/result1/Iteration1/t1216819465_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><soap:Header><wsa:Action>http://Neeman.Samples/ICalculator/Add</wsa:Action><wsa:MessageID>uuid:77c6d435-056c-4c42-983d-80df165ee023</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://yneeman01/CalcFedService/Service1.svc</wsa:To><wsse:Security><wsu:Timestamp wsu:Id="Timestamp-d027cc39-42b5-4e8d-9159-1a46b48affd0"><wsu:Created>2008-07-24T14:17:18Z</wsu:Created><wsu:Expires>2008-07-24T14:22:18Z</wsu:Expires></wsu:Timestamp></wsse:Security></soap:Header><soap:Body><Add xmlns="http://Neeman.Samples"><n1>2</n1><n2>5</n2></Add></soap:Body></soap:Envelope>